app/controllers/articulos_controller.rb

SELECT "articulos".* FROM "articulos"
---
    def index
        @articulos = Articulo.all

INSERT INTO "articulos" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "titulo 2"], ["text", "texto 2"], ["created_at", "2018-07-10 23:18:10.750740"], ["updated_at", "2018-07-10 23:18:10.750740"]]
---
    def create
        #render plain: params[:articulo].inspect

        @articulo = Articulo.new(get_articulo_params)

        if @articulo.save

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @articulo = Articulo.find(params[:id])