app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nombre", "email", "login", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "Mauro"], ["email", "mguerra@virtual.com"], ["login", "mguerra"], ["created_at", "2018-07-10 23:55:13.797834"], ["updated_at", "2018-07-10 23:55:13.797834"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save