app/views/articulos/show.html.erb

SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = $1  [["articulo_id", 2]]
---
<h2>Comentarios:</h2>
<% @articulo.comentarios.each do |comentario| %>